# PANDAS cơ bản
## Nhập liệu

In [1]:
import pandas as pd

In [2]:
fruits = pd.Series(data = [10,11,'lon','be'],
                                index = ['sau rieng', 'vu sua', 'mang cut', 'oi'])
fruits

sau rieng     10
vu sua        11
mang cut     lon
oi            be
dtype: object

- Ở đây chỉ mục là Cột đầu tiên (Sau rieng, vu sua...)
- Còn data show ở cột thứ 2 (10, 11, lon, be..)

**Một số thuộc tính của Pandas SERIES**

In [3]:
print('Shape: ', fruits.shape)
print('kết quả của phép fruits.ndim: ',fruits.ndim, '\n Kết quả là: 1 thì là pandas series \n 2: là dataframe.')
print('size: ',fruits.size)
x = 'vu sua' in fruits
print('vu sua co trong fruits: ',x)

Shape:  (4,)
kết quả của phép fruits.ndim:  1
 Kết quả là: 1 thì là pandas series
 2: là dataframe.
size:  4
vu sua co trong fruits:  True

**Truy Cập dữ liệu trong pd SERIES**

In [4]:
print('data of sau rieng: ', fruits['sau rieng'])
print('data of many thing bằng LABEL: \n', fruits[['vu sua','mang cut']])
print('data of many thing bằng INDEX: \n', fruits[[0,1]])
print('Dùng .loc và .iloc để truy cập theo LABEL và INDEX: \n',fruits.loc[['mang cut','oi']], '\n', fruits.iloc[[2,3]])

data of sau rieng:  10
data of many thing bằng LABEL:
 vu sua       11
mang cut    lon
dtype: object
data of many thing bằng INDEX:
 sau rieng    10
vu sua       11
dtype: object
Dùng .loc và .iloc để truy cập theo LABEL và INDEX:
 mang cut    lon
oi           be
dtype: object
 mang cut    lon
oi           be
dtype: object

**Lấy data ra và xoá data đã lấy bằng cách dùng .drop()**

In [5]:
fruits.drop('oi',inplace = True)
fruits

sau rieng     10
vu sua        11
mang cut     lon
dtype: object

**Tính toán số học trên pandas SERIES như là numpy**

In [6]:
# import pandas
import pandas as pd
# tạo 1 Series mới
fruits= pd.Series(data = [10, 6, 3,], 
                  index = ['apples', 'oranges', 'bananas'])
print('Original grocery list of fruits:\n ', fruits)
print('--'*10)
print('*2 cho fruits: \n', fruits*2)

Original grocery list of fruits:
  apples     10
oranges     6
bananas     3
dtype: int64
--------------------
*2 cho fruits:
 apples     20
oranges    12
bananas     6
dtype: int64

**Có thể sử dụng cả phép luỹ thừa ..**

In [7]:
import numpy as np
print('phép luỹ thừa cho fruits: \n', np.power(fruits,2))

phép luỹ thừa cho fruits:
 apples     100
oranges     36
bananas      9
dtype: int64

## DATA FRAME trong PANDAS

### 1. Tạo thủ công

In [8]:
import pandas as pd
item = {'thanh': pd.Series(data =[21,171,59],
                          index = ['tuoi', 'chieu cao', 'can nang']),
           'vinh': pd.Series(data = [19,168,45,1],
                            index = ['tuoi','chieu cao','can nang','co benh'])}
table_item = pd.DataFrame(item)
table_item

           thanh  vinh
can nang    59.0    45
chieu cao  171.0   168
co benh      NaN     1
tuoi        21.0    19

**Bảng không có index** -> Tự thêm index theo chỉ mục bắt đầu từ 0

In [9]:
import pandas as pd
item1 = {'thanh': pd.Series(data =[21,171,59]),
           'vinh': pd.Series(data = [19,168,45,1])}
table_item1 = pd.DataFrame(item1)
table_item1

   thanh  vinh
0   21.0    19
1  171.0   168
2   59.0    45
3    NaN     1

### Lấy thông tin

In [10]:
print('Giá trị phép .ndim là: ',table_item.ndim,'\n','trả về 2 tức là DATA FRAME')
print('Shape: ',table_item.shape)
print('size: ',table_item.size)
print('Dữ liệu: \n',table_item.values)
print('Chỉ mục: \n',table_item.index)
print('Dữ liệu cột: \n',table_item.columns)

Giá trị phép .ndim là:  2
 trả về 2 tức là DATA FRAME
Shape:  (4, 2)
size:  8
Dữ liệu:
 [[ 59.  45.]
 [171. 168.]
 [ nan   1.]
 [ 21.  19.]]
Chỉ mục:
 Index(['can nang', 'chieu cao', 'co benh', 'tuoi'], dtype='object')
Dữ liệu cột:
 Index(['thanh', 'vinh'], dtype='object')

### Ngoài ra có thể tạo DATAFRAME bằng LIST (những bảng trả về k được chứa giá trị NaN -Tức là phải khớp các giá trị)

In [11]:
import pandas as pd
data = {'Intetger':[1,2,3],
       'Float':[1.1,2.2,3.3]}
df = pd.DataFrame(data)
df

   Intetger  Float
0         1    1.1
1         2    2.2
2         3    3.3

### Dùng dictionary

In [12]:
import pandas as pd
items = [{'bike':1,'pants':3},
        {'bike':3, 'watches':5}]
store_items = pd.DataFrame(items)
store_items

   bike  pants  watches
0     1    3.0      NaN
1     3    NaN      5.0

**Cách làm trên dùng chỉ mục index 1 cách tự động, Muốn can thiệp vào index ta làm như sau**

In [13]:
store = pd.DataFrame(items, index = ['store 1', 'store 2'])
store

         bike  pants  watches
store 1     1    3.0      NaN
store 2     3    NaN      5.0

### Truy xuất phần tử trong DF, lấy theo hàng tao phải dùng .loc với LABEL hoặc .iloc với INDEX

In [14]:
print('cột BIKE: \n',store[['bike']])
print('cột BIKE and PANTS: \n',store[['bike','pants']])
print('hàng STORE 1 với .iloc: \n',store.iloc[[0]])
print('hàng STORE 2 với .loc: \n', store.loc[['store 2']])
print('Data của 1 ô: \n', store['bike']['store 2'])
print('Dùng .iloc: \n',store.iloc[0][1])

cột BIKE:
          bike
store 1     1
store 2     3
cột BIKE and PANTS:
          bike  pants
store 1     1    3.0
store 2     3    NaN
hàng STORE 1 với .iloc:
          bike  pants  watches
store 1     1    3.0      NaN
hàng STORE 2 với .loc:
          bike  pants  watches
store 2     3    NaN      5.0
Data của 1 ô:
 3
Dùng .iloc:
 3.0

**Thêm bớt cột** dùng LIST phải chú ý có cả 2 giá trị ở store 1 và 2 nếu không sẽ bị lỗi

In [15]:
store['shirt'] = [15,5]
store

         bike  pants  watches  shirt
store 1     1    3.0      NaN     15
store 2     3    NaN      5.0      5

**Thêm hàng dữ liệu** Dùng .append

In [16]:
new_items = [{'bike': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]
new_store = pd.DataFrame(new_items, index = ['store 3'])
new_store
store_item3 = store.append(new_store, sort = False)
store_item3

         bike  pants  watches  shirt  glasses
store 1     1    3.0      NaN   15.0      NaN
store 2     3    NaN      5.0    5.0      NaN
store 3    20   30.0     35.0    NaN      4.0

**Thêm Cột Dữ liệu** Dùng .insert

In [17]:
store_item3.insert(5,'shoes',[8,5,2])
store_item3

         bike  pants  watches  shirt  glasses  shoes
store 1     1    3.0      NaN   15.0      NaN      8
store 2     3    NaN      5.0    5.0      NaN      5
store 3    20   30.0     35.0    NaN      4.0      2

**Xoá hàng, cột dữ liệu dùng .drop với axis = 0, 1**

In [19]:
store_item3 = store_item3.drop(['glasses','shoes'], axis = 1)
store_item3

         bike  pants  watches  shirt
store 1     1    3.0      NaN   15.0
store 2     3    NaN      5.0    5.0
store 3    20   30.0     35.0    NaN

In [20]:
store_item3 = store_item3.drop('store 3', axis = 0)
store_item3

         bike  pants  watches  shirt
store 1     1    3.0      NaN   15.0
store 2     3    NaN      5.0    5.0

### Xử lý NaN

In [22]:
import pandas as pd
# We create a list of Python dictionaries
items = [{'bikes': 20, 'pants': 30, 'watches': 35, 
          'shirts': 15, 'shoes':8, 'suits':45},
         {'watches': 10, 'glasses': 50, 'bikes': 15, 
          'pants':5, 'shirts': 2, 'shoes':5, 'suits':7},
         {'bikes': 20, 'pants': 30, 'watches': 35, 
          'glasses': 4, 'shoes':10}]
# We create a DataFrame  and provide the row index
store_items = pd.DataFrame(items, index = ['store 1', 'store 2', 'store 3'])
# We display the DataFrame
store_items

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

**Xem có bao nhiêu giá trị NaN**

In [26]:
desc = store_items.isnull().sum()
print('giá trị là NaN của từng cột dữ liệu: \n',desc)
print('Tổng các giá trị NaN: \n',desc.sum())

giá trị là NaN của từng cột dữ liệu:
 bikes      0
pants      0
watches    0
shirts     1
shoes      0
suits      1
glasses    1
dtype: int64
Tổng các giá trị NaN:
 3

In [27]:
store_items = store_items.fillna(0)
print('Kết quả trả về sau khi đã xử lý NaN: \n',store_items)

Kết quả trả về sau khi đã xử lý NaN:
          bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      0.0
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     0.0     10    0.0      4.0

## Load File .csv lên

In [29]:
import pandas as pd
google_stock = pd.read_csv('data/GOOG.csv')
print('type: ',type(google_stock))
print('shape: ',google_stock.shape)
google_stock

type:  <class 'pandas.core.frame.DataFrame'>
shape:  (253, 7)

,Date,Open,High,Low,Close,Adj Close,Volume
0,2020-02-25,1433.000000,1438.140015,1382.400024,1388.449951,1388.449951,2478300
1,2020-02-26,1396.140015,1415.699951,1379.000000,1393.180054,1393.180054,2202400
2,2020-02-27,1362.060059,1371.703979,1317.170044,1318.089966,1318.089966,2978300
3,2020-02-28,1277.500000,1341.140015,1271.000000,1339.329956,1339.329956,3789100
4,2020-03-02,1351.609985,1390.869995,1326.814941,1389.109985,1389.109985,2431500
...,...,...,...,...,...,...,...
248,2021-02-18,2110.389893,2132.735107,2103.709961,2117.199951,2117.199951,1121600
249,2021-02-19,2119.270020,2130.530029,2097.409912,2101.139893,2101.139893,1457400
250,2021-02-22,2067.000000,2091.419922,2062.139893,2064.879883,2064.879883,1366200
251,2021-02-23,2025.010010,2082.010010,2002.020020,2070.860107,2070.860107,1666500
252,2021-02-24,2041.829956,2100.780029,2038.130005,2095.169922,2095.169922,1247400

### In ra 5 (mặc định) hàng đầu và 7 hàng cuối

In [32]:
google_stock.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2020-02-25,1433.000000,1438.140015,1382.400024,1388.449951,1388.449951,2478300
1,2020-02-26,1396.140015,1415.699951,1379.000000,1393.180054,1393.180054,2202400
2,2020-02-27,1362.060059,1371.703979,1317.170044,1318.089966,1318.089966,2978300
3,2020-02-28,1277.500000,1341.140015,1271.000000,1339.329956,1339.329956,3789100
4,2020-03-02,1351.609985,1390.869995,1326.814941,1389.109985,1389.109985,2431500

In [33]:
google_stock.tail(7)

,Date,Open,High,Low,Close,Adj Close,Volume
246,2021-02-16,2104.360107,2152.679932,2104.360107,2121.899902,2121.899902,1132900
247,2021-02-17,2100.000000,2133.659912,2098.919922,2128.310059,2128.310059,1070100
248,2021-02-18,2110.389893,2132.735107,2103.709961,2117.199951,2117.199951,1121600
249,2021-02-19,2119.270020,2130.530029,2097.409912,2101.139893,2101.139893,1457400
250,2021-02-22,2067.000000,2091.419922,2062.139893,2064.879883,2064.879883,1366200
251,2021-02-23,2025.010010,2082.010010,2002.020020,2070.860107,2070.860107,1666500
252,2021-02-24,2041.829956,2100.780029,2038.130005,2095.169922,2095.169922,1247400